#include<iostream>
using namespace std;

int main() {
	int i = 5;
	
	int *p = nullptr;

	/*
	情况一：指针直接指向对象地址
	*/
	p = &i;
	//cout << p << endl;
	//情况一结果为地址：0055F818
	//这代表此时指针存的是地址

	//情况二：指针指向对象,会报错，不能运行
	//p = i;

	//情况三：带*的指针指向地址，报错，不能运行
	//*p = &i;

	//情况四：带*的指针指向对象
	//*p = i;
	//得出结果与情况一相同

	//情况五，直接输出带*的指针,代表指针的解引用，输出的是对象值，即解答对象的地址代表的值
	//cout << *p << endl;

	//情况六 p = &i;与*p2 = i;代表的地址相同吗？前提条件，指针p与p2都是非空指针,空指针不得查看地址
	//int &j = i;
	//int *p2 = &j;
	//cout << "p的地址为：" << p << endl;
	//cout << "p2的地址为：" << p2 << endl;

	system("pause");
}